[{"date":"1/1/25","notes":"kinda ironic that today was the first day of 2025 and it was still shit. tired as hell too lol"},{"date":"1/2/25","notes":"spent a lot of time tuning my notion, ive been extremely sleepy lately for whatever reason"},{"date":"1/3/25","notes":":(. bachelors convocation. have never felt this unattractive before, lowkey was considering plastic surgery for a good part of today. did not want to be available for everybodys perception. but worked on notion finally lmao"},{"date":"1/4/25","notes":"had to do fuckall assignments all day while nursing bad cramps and somehow still have 1 left but icba"},{"date":"1/5/25","notes":"rediscovered running on air and i cannot express enough how much i needed it in my life at the moment"},{"date":"1/6/25","notes":"lab practical luck strikes again! finished roa, feel this weird mixture of optimism and nostalgia and sadness that i can't quite mentally dissolve"},{"date":"1/7/25","notes":"extremely uneventful day further marred by my notion web application committing suicide. oh great my kindle stopped working too "},{"date":"1/8/25","notes":"another uneventful day. did my MATLAB internal, listened to punisher and thats it, but all of yesterday's problems got solved"},{"date":"1/9/25","notes":"absolutely no motivation to live on especially with the world going to shit and as such. i dont know what to do or how to live"},{"date":"1/10/25","notes":"once again fully nothingburger day because i dont know what to do with my time in the face of no motivation-situational depression-the world burning"},{"date":"1/11/25","notes":"wrote an entire analytical piece on imperial japan-kawaii culture with ammu dearest and cleared my whatsapp out, finally"},{"date":"1/12/25","notes":"finished all remaining whatsapp clearances and pending, final assignment work. need to start reading more books and watching more movies"},{"date":"1/13/25","notes":"last day of the semester, almost missed the morning quiz but made it in time, returned home to fucking around as usual and finished a mid yaoi"},{"date":"1/14/25","notes":"found a new app to get addicted to (xiaohongshu). good road trip from blr to hyd, rediscovered all of milgram's music again"},{"date":"1/15/25","notes":"literally became a lesbian niche celebrity for a while on xhs today and loving all the attention so much...havign so much fun flirting with chinese girls oh my days"},{"date":"1/16/25","notes":"one of those extremely aimless days that are so boring its almost depressing, lack of will to anything at all and lowkey sad asfk at not being able to have a wechat"},{"date":"1/17/25","notes":"another completely aimless day (same as above) but i watched severance s2 e1 and started major work on emptying twitter data at night"},{"date":"1/18/25","notes":"finished uploading the remaining twitter links to archive/sites and also went to IKEA, obviously fucked the food there up, got myself a neat little table for new desktop too #consumerpilled"},{"date":"1/19/25","notes":"forced myself to start math studying but my attention span is so fried it did not work out, finished hsr quest + finally got a WeChat account!"},{"date":"1/20/25","notes":"i dont even know how the day just randomly passed me by, i gained consciousness at around like 4 pm and it was a flurry of mydei and neocities since then. did not study shit and the anxiety is finally starting to give way Lmao...im screwed if i dont at least start tmrw"},{"date":"1/21/25","notes":"literally was out all day carrying random chores out but came home to working on my website again. just some tweaks though"},{"date":"1/22/25","notes":"did sufficient amount of math but it still wasnt exactly enough, got big herta and stressed over the prospect of building so many damn characters. fucked around on twitter for quite a long time and ultimately felt kinda depressed again...also finished low tide in twilight and surprisingly found a second part to roa? did not hit as hard as part 1 but it was sweet"},{"date":"1/23/25","notes":"was supposed to be a math machine today but found new yaoi and wasted my entire day on it. the next 3 days are going to be mega painful (the yaoi was nice though)"},{"date":"1/24/25","notes":"eusexua'd and severance'd to the sun and did fuckall mathematics im so worried..."},{"date":"1/25/25","notes":"tried doing some amount of math but was more concerned about getting my neocities to 200 followers (some fucker unfollowed immediately after i posted the thank you message).....went out to taramati to eat and reminiscing older memories was pretty bittersweet. oh also consumed a lot of Demian today its like crack to me"},{"date":"1/26/25","notes":"spent 70% of the day in car, discovered binaria/annabel/anNina's discog fully and felt spiritually fulfilled"},{"date":"1/27/25","notes":"the panic finally set in (one day before the test Per usual) and most of the day (80%) was spent nursing that panic. the rest on actually studying"},{"date":"1/28/25","notes":"gave a painfully mid math exam today but at least its over, much emotional turmoil over spoorthi the fraud's alleged wisdom and had to go through fuckass global internships in physics again. idgaf anymore though"},{"date":"1/29/25","notes":"really wanted to study CM from the morning onwards but as usual did fuckall, reactivated main twitter and did some spring cleaning, wasted a lot of time on twitter tbvh"},{"date":"1/30/25","notes":"mid CM exam even though i was hoping it wouldnt be, but oh well. got really into osaka uni's masters prospectives"},{"date":"1/31/25","notes":"every day really is an experiment in finding new ways to waste time because why did i spend 90% of it on picrews and potential usernames for diff sites...."},{},{"date":"2/1/25","notes":"extremely ass day, finished 2 yaois, the last but 2 episodes of GAP and did not do anything productive at all"},{"date":"2/2/25","notes":"finally fully finished GAP....i will miss it :( big teasized redebut + started studying early but ended up pushing the important stuff to tomorrow per usual"},{"date":"2/3/25","notes":"wrote exam. sufficiently mid. super tired and surprisingly got lingsha 20 pulls in, ig as a way of apology by hoyo for no 600s"},{"date":"2/4/25","notes":"started studying well in advance today and i actually Could do it? definitely still short on dopamine but i forced myself anyway...missed gnsn a lot :("},{"date":"2/5/25","notes":"finished exams woohoo!!!! best exam i gave out of the 4 lol, very predictable, also came home and did plenty of odd jobs/finished a lot of pending yaoi/nptel assignment/hsr grinding....."},{"date":"2/6/25","notes":"day of reprieve before the practicals begin. read a bunch of yaoi but most importantly grinded the absolute living fuck out f hsr"},{"date":"2/7/25","notes":"came to college for practical practice (did that), then advocated 2ish hours to freaking out over severance and got back to practical mode again"},{"date":"2/8/25","notes":"gave GPL practical it was good!!!! not the best case scenario but still did okay. booked interstellar tickets :)"},{"date":"2/9/25","notes":"FINISHED ALL MY PRACTICALS EXCEPT MATLAB RAHHHHH also read yaoi but the main event for today was interstellar rewatch and although it was kinda mid (:() i still enjoyed it sm...also changed phone layout!"},{"date":"2/10/25","notes":"matlab was a piece of cake and i was worrying for no reason. came home and spent my first half-day of freedom wasting time and reading yaoi and inside mari (fire manga though)"},{"date":"2/11/25","notes":"read some yaoi......twitter surfed....really sad im wasting my free days like this...also finally replied to ammu's dms"},{"date":"2/12/25","notes":"watched 1-3 of twin peaks! didn't much outside of that though, had a headache which was pretty annoying"},{"date":"2/13/25","notes":"random stuff like carrd updations, trying to make the vscode switch etc, also got really into milgram though im yet to learn 80% of the lore"},{"date":"2/14/25","notes":"was supposed to seriously code today but somehow spent the entirety of it being depressed about alien stage (and didnt even learn its lore LOL)...tomorrow ive gyatt to be productive"},{"date":"2/15/25","notes":"finished the index page, only that but its definitely a start! gonna start my japanese and physics/math notebooks tomorrow with peripheral cleaning :) hope sorting everything out puts me at peace to work on other things better"},{"date":"2/16/25","notes":"tried clearing at least some work off my mountain of tasks (semi partially successful)...went to lulu though and ate pretty good"},{"date":"2/17/25","notes":"cleared all of the computer (except art folder)! also Finally started seriously learning art, gonna practice everyday henceforth...also talked @ a driving school :]"},{"date":"2/18/25","notes":"lost myself completely to the art sauce ngl, spent the day trying to work several facets of rendering and drawing out (and worked on 2 studies!)"},{"date":"2/19/25","notes":"day before travel and also mom came home but did spend 80% of the day on art meta again, the rest on sorting all my cap brushes out for once lol "},{"date":"2/20/25","notes":"boarded train for rajasthan this morning, finished 91 days and true detective and they were both equally crushing :( my earphone connector stopped fucking working though so i can't watch anything else anymore  "},{"date":"2/21/25","notes":"literally just read a somewhat mid psych thriller webtoon all day (vigilante) because i couldn't watch anything lol…what a boring day. at least the dratted train journey is done"},{"date":"2/22/25","notes":" stayed at Jhuma mashi's house all day (exceptionally boring), ate really boring food bar kadai paneer @ night. i can't believe i'm having no fucking fun in rajasthan"},{"date":"2/23/25","notes":"some mehndi function?? had to sit around preening for a bit (by bit i mean 2-3 hours) but spent the remaining on reading random yaoi and watching/starting texhnolyze….i wanna go home"},{"date":"2/24/25","notes":"went on a chittourgarh fort tour, was an okay experience but i slept through 80% of the car rides and listened to pj harvey and related music during the rest. came home to have mehndi done on my hands as well,"},{"date":"2/25/25","notes":"wedding day. really didn't do much outside of reading random yaoi + vigilante and running errands…the wedding food was right up my alley though. cannot elaborate enough just how royally bored i've been throughout this entire ordeal"},{"date":"2/26/25","notes":"i've literally been eating paneer day and night LMAOO…also read lots of random yaoi since there wasn't really the opportunity or resources to do anything else. finally leaving tomorrow!!!!"},{"date":"2/27/25","notes":"caught the plane in the morning and that is all okay but the moment i came home.....the worst illness of my life took hold of me, i felt weak in every part of my body, any movement was causing sparks to run through my body and my limbs felt heavy af. went to sleep @ 6 pm and did not look back since"},{"date":"2/28/25","notes":"slept for 18 hours straight LMFAO but i feel better 2day, didnt really do anything ourside of grinding DU and fucking around and freaking out over new severance"},{},{"date":"3/1/25","notes":"went to LULU (80% of the day) final stretch of brush exports part 1 (20% of the day)"},{"date":"3/2/25","notes":"final stretch of brush exports part 2, celebrated haikyuu coming back, hsr new update, thats p much it since i woke up quite late"},{"date":"3/3/25","notes":"pretty much coded all of today, very refreshing to return to this lifestyle! yaoid and hsred the rest of the time though"},{"date":"3/4/25","notes":"coded and worked on notion for a better half of the day (just aesthetic stuff though), creative block is a nasty bitch"},{"date":"3/5/25","notes":"coded all day tbh....then went to kadamba after a rlly long time and ate a big ass chana bhatura. also boy meets maria was so mid"},{"date":"3/6/25","notes":"finished cleanup of all codes except diary i DID IT! granted ive been spending all my time on coding but at least i can finish some new pages and be done"},{"date":"3/7/25","notes":"finally finished cleaning up ALL MY EXISTING PAGES!!!! also finished an application (#powerhouse) and i still hate my index page so fucking much"},{"date":"3/8/25","notes":"50% day on notion tweaks, 50% day on coding tweaks, gaps in between i started reading the summer hikaru died...goated af!"},{"date":"3/9/25","notes":"bought a new laptop 2day :) first part of the morning was spent doing some odd jobs but rest of the day was spent on browsing digital stores...then 8pm to 11pm on setup lol"},{"date":"3/10/25","notes":"first day of college but it was pretty short, was on a high from showing my website/graphic design work to somebody not on the internet tbh! brain was scrambled most of the day for whatever reason, spent the evening/night setting laptop up"},{"date":"3/11/25","notes":"was having an interesting statmech session but had to leave in between to catch the flight to kolkata…had a nice glazed donut @ the airport :3 resumed texhnolyze"},{"date":"3/12/25","notes":"finished texhnolyze on the train….holy shit blew my fucking mind. hate the situation i'm in rn (away from home about to be held hostage for 5 days in a place i don't want to be in) but i have my nihilism and nihilistic media to keep me company ig"},{"date":"3/13/25","notes":"drive to read came back in FULL SWING BABIE!!! finished madonna in a fur coat and the remainder of demian (well...on my reread) and started reading the lost daughter but lowk dont find ferrante's writing all that special. travelled and was, around all day which enabled my reading of course"},{"date":"3/14/25","notes":"@ home (hotel) all day..put ferrante on pause in favor of a much more intriguing psychological thriller, + downloaded all of orb to consume over the next 2 train days :3"},{"date":"3/15/25","notes":"made a…somewhat very vexing and unfortunate financial decision but in other, better news have an extremely renewed interest in astronomy again thanks to orb (finished 12 episodes by midnight)"},{"date":"3/16/25","notes":"returned home in the late afternoon......spent the rest of the day tired and carrying out the goliath ts4 fix mission on new laptop"},{"date":"3/17/25","notes":"first day of college after gap (very boring), let the grades cat slip out of the bag FINALLY, finished fixing ts4 yay....also listened to telugu songs from back when after maybe 5 years?"},{"date":"3/18/25","notes":"college was whatever but i finally resumed taekwondo again.....everythings the same there..(my thighs were thoroughly assaulted)"},{"date":"3/19/25","notes":"trudged up and down with my sore thighs of course, college, odd jobs @ home. super sleepy all day "},{"date":"3/20/25","notes":"went to college + didnt really do anything of substance in the remaining time (some coding/media foraging was done)"},{"date":"3/21/25","notes":"day off from college due to some alleged science day, completed my shrine fully! mainly just coded and spent the rest of the day doing random shit/testing stuff out on ts4, watched severance final....what a 2 month ride lol"},{"date":"3/22/25","notes":"studied somewhat for NPTEL (like 1 hour total) and had to clown myself because taekwondo class had ended when i reached it...coding was done in part too + fruitless hsr runs"},{"date":"3/23/25","notes":"wrote NPTEL astro exam today, whatever happens is up to god but i hope i pass...creative block hitting me like a damn truck re:media-logs"},{"date":"3/24/25","notes":"looked for inspo etc but mainly spent time on one of my sims, finished 4 of her outfits! yippee"},{"date":"3/25/25","notes":"ate one of those big ass pizzas again today :3 never gets old LOL! came home and actually started putting work into making my ts4 graphics...cc next"},{"date":"3/26/25","notes":"THEY FUCKING SUSPENDED MY TUMBLR ACCOUNT. also hurt my upper right gums for some reason :( "},{"date":"3/27/25","notes":"boring college day per usual (sir made me chaperone my batch since ive been here for 3289587 years) but met nanda and omfg he cracked jam :') im so happy for him ngl...i hope i go to japan as well and we're all happy... + lots of sim content progress today gna start blender soon. inspired to study sooo much btw ^__^"},{"date":"3/28/25","notes":"finally made my first mod woopee! its a main menu override but its def a start...its hard trying to build a community doe"},{"date":"3/29/25","notes":"set a lot of my profiles up....woke up pretty late so 60% of the day was spent on taekwondo class and preparation leading upto it/after it"},{"date":"3/30/25","notes":"twt somehow blew up? also tried my hand at a 2nd mod and it was a disaster lmfaooo anyway finished 2 main sims should move onto the other 2 soon!"},{"date":"3/31/25","notes":"spent the day navigating around loading screen creation/ts4 creator assets and made stuff im satisfied with! hope to make clothing/hair cc incredibly soon :3 clg was off btw"},{},{"date":"4/1/25","notes":"literally only ben simming and taekwondoing lately lol went to college then immediately to taekwondo and came home to game all evening and pre-night..i must lock in soon"},{"date":"4/2/25","notes":"boring day...no substantial progress in anything at all but at least my 4 sims are genetically done and dusted"},{"date":"4/3/25","notes":"lab @ college + taekwondo + sims in the evening + i've never felt as out of sorts about everything as i did today and lately"},{"date":"4/4/25","notes":"spent the day on vande bharat and finished lain...it was good but not life-changing? might have to lock in and read the explanation site i found but my god was it stunning (pirating discourse on simstwt)"},{"date":"4/5/25","notes":"puja day. chaperoned kids and babies and had a blast as usual! sort of hectic which was expected but i was happy to provide myself to communal work and revel in kids' admiration"},{"date":"4/6/25","notes":"lowkey extremely sick today but kebab platter in the afternoon and biryani @ night...yum...also downloaded lots of new books/felt very isolated and out of place amidst twt friends #lol idt ill be active in a very long time"},{"date":"4/7/25","notes":"sickness (extreme throat pain) continued well into the train journey + came home and crashed into bed immediately. then went to sleep again 3 hours later!"},{"date":"4/8/25","notes":"college....there was a tangible lull in p much everything including taekwondo class, also finally revised until form 7 lets fucking go"},{"date":"4/9/25","notes":"very slow day, spent time (outside of college) doing the minimalest possible hsr update work, relight + random ts4 tweaks. i need to do a 50-50 trial again it seems :( also new graphics etc i rlly need to start making cc"},{"date":"4/10/25","notes":"thursday"},{"date":"4/11/25","notes":"came home early and spent another 80 (:[) on milkshakes (packaged ones) because i couldnt take the drought...im so screwed if #they know of my bank balance, downloaded realistic save file + seaside house!"},{"date":"4/12/25","notes":"lots of graphic design (only graphic design done tbh) + engagement farming on twt, i hope the audience is good enough to earn soon"},{"date":"4/13/25","notes":"groundwork for val's outfits....made new oomfs + fixed base game, basically just spent the day prettying game and dl-ing random shit"},{"date":"4/14/25","notes":"ambedkar jayanti holiday so of course i wasted it fully on compiling and posting valentine's lookbook"},{"date":"4/15/25","notes":"lots of discussions and looking around wrt jpn universities, i have to write a research plan??? also i love making douyin sims ^__^"},{"date":"4/16/25","notes":"finished viral hit at least (it rlly tanked s2 onwards huh) and took the first step towards cc creation/3D modeling!"},{"date":"4/17/25","notes":"thursday except i skipped lab :3 many leg combos @ taekwondo today and i loved doing them...slept for 2 hours before going lol"},{"date":"4/18/25","notes":"lots of pending/odd jobs done, baby's first sims community beef LOL (i won) + first public reshade preset!"},{"date":"4/19/25","notes":"no tangible time @ all today like i woke up late, twittered + simmed for 4 hours, went to taekwondo @ 5, came home built on sims and slept?"},{"date":"4/20/25","notes":"majority of day spent trying to figure tv overrides out and they didn't even end up working :/ i rlly need to stop simming and do other stuff but i physically cant aur.."},{"date":"4/21/25","notes":"tv override saga and i successfully posted it online :3 also made another cutie sim (still need to stop simming btw)"},{"date":"4/22/25","notes":"made a masc sim and now i want to make a coquette save out of my newfound cas skill w milk preset (i will)...tiring ahh day but thats everyday recently, also finished her quest #peak"},{"date":"4/23/25","notes":"skipped college lawl + fucked around on ts4 per usual/made cc wrench overrides/saw val in others games :3"},{"date":"4/24/25","notes":"who knew all it'd take was one day of twt inactivity for me to be put off by ts4 🙏🏽 ofc still going to do everything planned but in lesser amounts/worked on build + simself 2day!"},{"date":"4/25/25","notes":"joined tea-ful sims gc....finally feeling @ home among so many ppl i like although that wasnt my goal starting i love being a people person! also my neapolitan pie menus (that i worked on 2day) were widely critically acclaimed :3"},{"date":"4/26/25","notes":"too much happened today? first of all went to lulu, started blowing tf up on twt? big design changes to all sims socmed, VCed with the sussy gang after 2 whole years (+ posted on ig bruh.), mailed an IISc guy whos super cool and my neocities site started blowing up too all while nursing exam anxiety??? mind feels weirdly mangled so im gonna take a breather and map my internet presence out + Actually study tmrw"},{"date":"4/27/25","notes":"dead dry day with no interaction, action or tangible work done. ive also not studied ^__^"},{"date":"4/28/25","notes":"exam acc went pretty well hello? also i might be a cas magician deadass + theres so much to do...im overwhelmed....life is short when youre in uni"},{"date":"4/29/25","notes":"stressed Too damn much this morning but somehow 2nd exam was easy af as well #luckedout + i might be a cas magician x2"},{"date":"4/30/25","notes":"3rd exam! super easy since i'm basically repeating the course, + fucked around with some editing + chatted a bit"},{},{"date":"5/1/25","notes":"made my very first male sim today!!! also was supposed to study (study holiday) but per usual i while away most of the day (esp with cass drama on simtwt lolz)"},{"date":"5/2/25","notes":"exams done woohoo! very nothingburger paper today though but atp idgaf, started working on teaser sims + setting up"},{"date":"5/3/25","notes":"for the first time i didnt do much ts4 posting...felt especially invigorated @ taekwondo + started notion organizing/rereading yaoi :D"},{"date":"5/4/25","notes":"spent the day setting my newest lookbook up and posting it :heartbreak:"},{"date":"5/5/25","notes":"tiring day but not bc of anything i did...woke up late/went to fuckass college and came home only to go house hunting bc our rentee is a jerk, then sleep"},{"date":"5/6/25","notes":"went to college per usual + finally found a house omg! dont even mind the day being wasted but we can at least be @ peace now"},{"date":"5/7/25","notes":"skipped college because i didnt rlly feel like it but did make the day somewhat productive because i taught myself how basic meshing works! worked on y2k lookbook also"},{"date":"5/8/25","notes":"thursday + lots of hullaballoo over the war, personal time (after returning home) was spent on troubleshooting "},{"date":"5/9/25","notes":"skipped college today too :P  mom apparently lost her phone? also fully troubleshooted worked on patisserie YIPPEE"},{"date":"5/10/25","notes":"boring ahh day but i got a lot of attention online + made my first sims event...did some odd list jobs too i think (really need to lock in for schoolwork)"},{"date":"5/11/25","notes":"did lots of stuff today...FINALLY SENT RESEARCH PROPOSAL OFF! tiktok/ig still flopping, released title card and started posing! (i hope i go to japan or ill gen kms this time)"},{"date":"5/12/25","notes":"finally finished a kind of scuffed and ugly but full hair mesh after skipping college! finally tipped the engagement scales on twt, we've never been so back bby + char sheets + 5 usd from jama :D"},{"date":"5/13/25","notes":"tiana's lookbook, wanting to redo char sheets? also went to clg after skipping several days lol"},{"date":"5/14/25","notes":"no classes so i attempted meshing once more and it looked horrifying again, idk if i'll ever master blender ngl"},{"date":"5/15/25","notes":"thursday + lab ofc but most of the day was consumed in simstwt drama that i somehow got roped into w people i knew blocking or soft-blocking + whatnot? brother"},{"date":"5/16/25","notes":"train to hyd + very excruciating period pain But finally finished peak (ergo proxy) and discovered all of clairo's discog......i love media i love music i love living"},{"date":"5/17/25","notes":"continued with bags spam per usual then got my laptop fixed + tagged along for phone shopping/sim (card not game) fixing which took all day, tried meshing again"},{"date":"5/18/25","notes":"woke up to losing 70-80ish followers on simstwt <3 super fun times + defense attorneying 4 myself but im #free of that hellsite finally, study/meshing focus is abt to be lit"},{"date":"5/19/25","notes":"came back home, still bummed out over yesterday but slowly picking myself up over tumblr/pinterest rebranding etc, spent the day curating images (+ college was nothingburger and my earphones stopped fucking working)"},{"date":"5/20/25","notes":"talked to leo and surprisingly i feel much better on being offered an explanation + finality? started working on my neapolitan sim/dled base sims and finished organization yippee"},{"date":"5/21/25","notes":"2 hours free :D vvvv philosophical discussion in statmech class! worked on neapolitan simmie on coming home"},{"date":"5/22/25","notes":"statmech quiz which for the first time in RUAS i knew stuff about? lab till 5 :( super sleepy otw home"},{"date":"5/23/25","notes":"college of course, came home tired as always but went to lulu! did not quite enjoy the food as always though, finished lookbook prep"},{"date":"5/24/25","notes":"odd tasks but most of them were nothingburger, started cas bg work and posted lookbook etc"},{"date":"5/25/25","notes":"spent the whole day either sleeping or looking for things related/working on my rentry but i at least ended up finishing it"},{"date":"5/26/25","notes":"went for the singular lab....worked on rentry again and did social media revamps to the best of my ability"},{"date":"5/27/25","notes":"pseudo seminar today which went extremely well with no extra questions asked + everything cleared, finally developing a deeper appreciation and love for science? prepped simdump sims fully"},{"date":"5/28/25","notes":"college, went to kadamba for the usual bigass poori! finished sim dl work and posted my first sim dump ^__^"},{"date":"5/29/25","notes":"resumed taekwondo again after a gap....lull in subscriptions :("},{"date":"5/30/25","notes":"made my sexy gay male household but did not do much else...i need to be fucking put down (also first x7 clear!)"},{"date":"5/31/25","notes":"shifting preparation day, went to ikea and missed taekwondo but its fine because the meals i have there are heavenly, the queues were crazy? full bar italia discovery"},{},{"date":"6/1/25","notes":"shifting day i dont particularly want to talk about it. ate a mean paneer butter masala though"},{"date":"6/2/25","notes":"went to college amidst shifting chaos (fucking hate living here) but left early due to some meeting again...finished stat mech assignment fully + had to suffer through 7 hour long power shutdowns and carpentry"},{"date":"6/3/25","notes":"day was pretty boring personally (started another lookbook, stayed @ college till 5 for nothingburger purposes) but parents went to the police and claimed 3000/5000 back LOL"},{"date":"6/4/25","notes":"extremely sleepy etc figured out thesis work and what needs to be done, still hate current home"},{"date":"6/5/25","notes":"nothingburger but fulfilling college periods...came home to work on all lookbooks in general + i Rlly want to play genshin again"},{"date":"6/6/25","notes":"pretty slow day no classes, really just scrolled on ig all day + made final tweaks to older sims!"},{"date":"6/7/25","notes":"car drive day + addison's debut was Splendid, very scrumptious food-ing, did not do SHIT today either idk whatll happen to me"},{"date":"6/8/25","notes":"got lectured on incessantly about my inability to study for competitive exams again....nothing else done lol reupped faye lookbook after new screenies"},{"date":"6/9/25","notes":"train journey, although uncomfy enjoyed (the usual food) immensely, gilgamesh progress, went to clg by metro? + aimless fucking around @ home i dont even watch reels anymore"},{"date":"6/10/25","notes":"boring ahh day but at least i could hop on cas after reaching home. finished seminar with no hitches once again im on Fire"},{"date":"6/11/25","notes":"finished dolly sim shes soooo cute TT took some prep work but it paid off Yay also stayed till 5 for other ppl (rarted af seminars) but getting increasingly confident w comp. exams! and rin drama which was fun to partake in"},{"date":"6/12/25","notes":"got grilled so fucking bad in viva (made it out though) i had a dl headache and slept the entire time from coming home 2 night TT also pissed tf off @ sabrina kys lol"},{"date":"6/13/25","notes":"train day, first time going to the station all on my own, finished 80% of gilgamesh (its good but no wow factor as of yet)"},{"date":"6/14/25","notes":"day before leaving hyd boring per usual, the no. of odd jobs i finish per day still never finishing my list is concerning, photographed lots of old art!"},{"date":"6/15/25","notes":"came home yesterday, listened to full madonna album otw and was kinda sick...also found a good home @ long last in an extremely weird stroke of fate ?!"},{"date":"6/16/25","notes":"finished gilgamesh because classes got cancelled (not too impactful but it was beautiful) and also attended an empty lab...i need to start tiktokmaxxing"},{"date":"6/17/25","notes":"spent whole day at college per usual (although last class was off) then came home to bum all my time on sims telegram cc shopping. did clean up mods folder a little bit and attempted gyaru dolly sim #2"},{"date":"6/18/25","notes":"DEFINITIVE BAGGING OF INTERNSHIP !!!! discovered the joys of save file building and downloaded lots and lots of lots (lol) + troubleshooted for an embarrassing amt of time"},{"date":"6/19/25","notes":"got analysis for mock....abysmal quiz score but who gaf, viva was A-OK, hopped on sims 4 again (im addicted again), landlord row ."},{"date":"6/20/25","notes":"last day of ams classes, nothingburger seminar-only day, started lookbook processes again"},{"date":"6/21/25","notes":"kind of just lulled the day away i think....with no tangible work (or even timepass) done"},{"date":"6/22/25","notes":"got the gist of blender baking and processing under my belt! glad i took the leap of faith :)"},{"date":"6/23/25","notes":"lukewarm ahh day with a random quiz and moving stuff and mom being passive aggressive (+ mod release)"},{"date":"6/24/25","notes":"spent the non-college part of today fucking around on ts4 i think"},{"date":"6/25/25","notes":"last stat mech day :( + hauled my ass off per usual, and finally finished all pending submissions, life's first fit compliment it felt weirdly nice?"},{"date":"6/26/25","notes":"mix of emotions regarding various things idr wanna talk about it...anyway moving is happening in full swing"},{"date":"6/27/25","notes":"shifting day!!! caught up on yaoi + my tooth keeps fmu + met cute baby :) + alnst last episode..."},{"date":"6/28/25","notes":"only made a sum total of 2 sims today and did nothing else....im in a kind of weird work paralysis i think and i hate it"},{"date":"6/29/25","notes":"started task sorting at long last! also quite happy with the 2 sims i made today, only 1 more to go to start savefile work + tree making :) Need to lock in for everything else"},{"date":"6/30/25","notes":"finished all pending college work for good + pending sims screenshots/cc etc, onto new and bigger things over the next few months!"},{},{"date":"7/1/25","notes":"did nothing all day oh my goddddd i hate myself...started odd jobs and before i knew it it was lailu time (:D) + ikea so well. hope tomorrow is more fruitful"},{"date":"7/2/25","notes":"hsr patch day (got phainon yippees...quest was super depressinf) and..im not sure what else i did but i tweeted a lot and also did some pending (but important) irl tasks"},{"date":"7/3/25","notes":"lolita cc foraging day tbh. also had to make a useless trip to college that kinda sorta derailed my entire day"},{"date":"7/4/25","notes":"first step towards studying...emptied lots of random lists and organized tasks fully...lailu!"},{"date":"7/5/25","notes":"posted miku overrides + full brainstorming journey kickstarted :) woke up early naturally so i could finish wasting time early Lol"},{"date":"7/6/25","notes":"Finally got myself to start working on website again.....it'll only be an upward slope from now on i hope (i gotta academically lock in the coming week)"},{"date":"7/7/25","notes":"delved very deeply into neuromorphic coding for my future media-log I CANT WAIT TO GO LIVE WITH IT! + premium lailu time today hehe :3"},{"date":"7/8/25","notes":"lulu day....didnt rlly do much outside of very minimal coding :( i just feel so tired omfg but i need to study to be free..."},{"date":"7/9/25","notes":"dont know how but i somehow spent the entire day on a single diary entry and minimal website tweaks..im truly bottom of the barrel productive"},{"date":"7/10/25","notes":"somehow spent the entire day switching my blog's framework from hardcoding to JSON but hey at least i learnt something new"},{"date":"7/11/25","notes":"thought it would be saturday but woke up to a surprise friday...cant tell you how happy i was to have another day to waste (and waste it i did!)"},{"date":"7/12/25","notes":"been losing sleep in pursuit of site drafting except im busy as fuck atm and not doing anything about that either. Need to lobotomize myself for next week (and possibly the next 3 months)"},{"date":"7/13/25","notes":"was supposed to be studying but spent the day feeling Anxious about studying and moping about not being able to code.."},{"date":"7/14/25","notes":"exam was shit per usual. lucky shirt has stopped working"},{"date":"7/15/25","notes":"spent the morning cleaning out my sims 4 folders out + evening reading some amount of (mostly unimportant) portions lol"},{"date":"7/16/25","notes":"made a lot of changes to site (functionality wise) after majorly flunking exam ^__^ visited lailu's house"},{"date":"7/17/25","notes":"FINALLY circumvented the fontawesome restriction (by force dl-ing the icons) + fanlisting hunt while procrastinating"},{"date":"7/18/25","notes":"exam wasn't too bad wasn't too good but def could've been better (took all of the 3 hours) lailu house once again! started scrapbook work"},{"date":"7/19/25","notes":"cleaned out my sims 4, finished coding scrapbook.html with only a few flourishes left, other 3 pages i'm coming for you"},{"date":"7/20/25","notes":"lacklustre birthday (which is almost every birthday) but i am now 22"},{"date":"7/21/25","notes":"final exam (surprisingly okay despite being the scariest possibility) watched Kaun (mid) + set my sheet log up finally"},{"date":"7/22/25","notes":"coded most of today and still nowhere close to publishing changes.... ahhhh"},{"date":"7/23/25","notes":"lab was alright except the external was running his mouth a tad much + farmed all of (remaining) hsr and lost to fawk ass seele + spent a good amt of lost time on ts4! missed it"},{"date":"7/24/25","notes":"finallyyyy finished semester 2. couldnt do much of anything today because cramps took me tf out/sapped everything out of me"},{"date":"7/25/25","notes":"did nothing today really, outside of organizing stuff (but thats important too because i can't really function without Everything tidy in every aspect of my life)...spotify -> apple"},{"date":"7/26/25","notes":"parting w lailu was not daijobu :( spent the day releasing cc drafts"},{"date":"7/27/25","notes":"scheduled 7 hour road trip, lots of xiu xiu, indian indie + f5ve, iwhnkm was so crushing Wow."},{"date":"7/28/25","notes":"caught a very annoying cold and was rendered immobile for most of the day, shopped and dined at night though (came home and conked the fuck out)"},{"date":"7/29/25","notes":"cc organization + sim dls + making 3 sims took all day my bad"},{"date":"7/30/25","notes":"remaining spotify -> apple (still very cumbersome functionality for a stat obsessed person like me) + simslist finished, no work done because laptop was @ the repair centre"},{"date":"7/31/25","notes":"was supposed to do lots of site work today but this 4 year old girl latched onto me for some reason and played with me for 4 +  3 hours straight with a lunch-and-nap break in between? will never understand why kids love me so much.."},{},{"date":"8/1/25","notes":"i should make a #travel tag for days dedicated to travelling only i think. but anyway slept 50% and watched ODDTAXI the other 50% 10/10 changed my life it was incredible"},{"date":"8/2/25","notes":"tired most of the day + engaged in the website tweaks that had piled up for a while, surprised that took all day "},{"date":"8/3/25","notes":"woke up late...made new sim + dled random cc..wasted the day basically and was over @ CMDA from 5.00 to 9.30 so thats where all of my time went"},{"date":"8/4/25","notes":"#travelled (travel time was a dud)..we Hea at IITKGP!"},{"date":"8/5/25","notes":"first day of internship...spirits are high i feel #important af Also this shit is lowk so easy wdym this is phd work in a field Ive never dabbled in. website tweakzzzz"},{"date":"8/6/25","notes":"are internships usually always yawnfests that have you whiling the day away? anyhow uploaded site-changes after spending the day pretending to do meaningful work + IIT-ing"},{"date":"8/7/25","notes":"mostly coded all day"},{"date":"8/8/25","notes":"mostly coded all day x2 + whiled some time away @ internship"},{"date":"8/9/25","notes":"wasted the day on wplace but i made a cute hachiware ^__^"},{"date":"8/10/25","notes":"returned home from iitkgp....the past week was a perfect fever dream + visceral reaction to florence machine's discog (yet again)"},{"date":"8/11/25","notes":"had repair work happening throughout the day @ home...also did nothing but fuck around on ts4 (not even productively engaging with it kms) but did make+ dress a character up!"},{"date":"8/12/25","notes":"simmed the entire day and tried clearing DU in vain, we're packing this laptop up TOMORROW NO MATTER WHAT"},{"date":"8/13/25","notes":"hsr update! sworn off wplace and yet i found myself coloring in my giant harry du bois portrait @ kolkata, found out im 4w3?"},{"date":"8/14/25","notes":"profound work paralysis + finished The New Me...eh"},{"date":"8/15/25","notes":"minmaxxed (did achievements + hunted down all chests) and still no hysilens...also lowkey im kinda so sick"},{"date":"8/16/25","notes":"FINALLY got hysilens today and full cleared all endgames in a row :)) Also was properly incapacitated by my fawk ass cold all day and couldnt do shit except lie around"},{"date":"8/17/25","notes":"day: binged girl from nowhere s2 with a sore throat and headache night: lizard watching"},{"date":"8/18/25","notes":"forgive me lord for i have simmed again"},{"date":"8/19/25","notes":"^^ + went to gayeshpur! watched 2 whole CID episodes after literal decades"},{"date":"8/20/25","notes":"spent the day reading and sitting quietly and talking to ppl around me (insert victorian kim kardashian image)"},{"date":"8/21/25","notes":"ts4 troubleshoot mostly but Also finally finished diary start menu"},{"date":"8/22/25","notes":"icb i spent an entire day on configuring my diary's music player and making myself picrews...."},{"date":"8/23/25","notes":"finished remianing picrews and coded the 2 pending pages!"},{"date":"8/24/25","notes":"new alipore voyage! the baby, contrary to previous opinion, is very cute and sociable and i loved playing with him all day"},{"date":"8/25/25","notes":"some juvenile indie websurfing + spent the evening pirating fonts"},{"date":"8/26/25","notes":"continued pirating fonts...i have a splendid collection now"},{"date":"8/27/25","notes":"cramps :( and finally hit x7 on hsr but lowk losing interest"},{"date":"8/28/25","notes":"Finally invested time into making a ME collage...lots of overthinking + personal fuss over future academic prospects"},{"date":"8/29/25","notes":"spent da day whiling time away at the biophysics lab...showed prof my copypasted code which he said was Good. idol seeing @ midnapore :) good food day + renewed beatles interest!"},{"date":"8/30/25","notes":"woke up only to get shoved face first into an 8-hour train travel with 3+ switches, took on the responsibility of fully fixing my ts4 on coming home + my PC ran out of fuckin space!"},{"date":"8/31/25","notes":"village travel.....loved tottering around with cows and pigeons ngl it was super healing, also wdym i ate 10 pooris"},{},{"date":"9/1/25","notes":"caught up on sims posting, updates and patching up! hope to finish all sim intros tmrw and work on my website again"},{"date":"9/2/25","notes":"tried to finish remaking ALL OF MY MAIN SIMS and lowkey succeeded bar a few finishes and like 3 sims….sore throat and felt super sickly n feverish all day :("},{"date":"9/3/25","notes":"finished! simming lol. tried paying for the blender course through several ways to no avail (and much embarrassment), invited but non welcome guest came home . also first-watched devi"},{"date":"9/4/25","notes":"FINISHED finished my main sims for realsies this time...survival show style elimination for 4 of them </3 was able to buy tauve course :D compiled creators list!"},{"date":"9/5/25","notes":"pupu came 2 visit !!! continued work on website, finished some odd/pending tasks (digital) Final simdump dls...300 MB left :("},{"date":"9/6/25","notes":"pupu left... continued site work + wasted ample time (got on my hotel story grind again after maybe 10 years)"},{"date":"9/7/25","notes":"somehow all of us were mad at each other and my morning was spent at a temple against my wishes However the food banged"},{"date":"9/8/25","notes":"watched super boring movie...dled bunch of lots/made a resource side blog, lost a divuni for the first time in YEARS + made a cute sim for dl! super cute tbh :)"},{"date":"9/9/25","notes":"GAVE THE BARRACKPORE FOLKS A 5 CHICKEN FEAST PIZZA PARTY WITH MY OWN MONEY !! YIPPEE, watched 2 movies with da grandma but she leaves tonight TT"},{"date":"9/10/25","notes":"last day @ kolkata...wont miss the place but alr missing the people :( Spent the morning browsing ts4 builds (FOUND AN IKEA ONE) and the evening making a pixel room....jeez louise"},{"date":"9/11/25","notes":"on da train !!!! eden of the east was weird and fever dream-ish asf but enjoyable..slept most of the day away lwk also fascist down :)"},{"date":"9/12/25","notes":"reached hyderabad, lowkey just lay on my bed motion/aimlessly most of the day + finished hyd-specific stuff come evening"},{"date":"9/13/25","notes":"woke up super late...travelled to get my storage increased + had to spent the rest of my evening/night @ ashram :("},{"date":"9/14/25","notes":"mass tray file download + cc organizing part 1...cant believe this took an entire day start to end and its not even done yet (also somehow 70% of my day's food was sweet dishes)"},{"date":"9/15/25","notes":"mass tray file download + cc organizing part 2 BUT ITS FINALLY OVER! started practicing for GRE @ long last"},{"date":"9/16/25","notes":"worked Extensively on my status cafe theme once and for all Also responsiveness should be shot dead (billions must use a pc)"},{"date":"9/17/25","notes":"train-day and also last day @ hyd....packed ts4 lappy away for a while + made final tweaks to status cafe + finished eden of the east on da train"},{"date":"9/18/25","notes":"first day of college Wdym im one of 2 ppl in the nuc phy course. comp phy guy is bengali! lailu after 40 DAYSSS + had super red eyes all day :c sleep sched is about to do a 180"},{"date":"9/19/25","notes":"2nd day of college. nuc phy is basically like taking a personal tuition..too sleepy @ home to do anything meaningful"},{"date":"9/20/25","notes":"didnt much of anything today. applied to a bunch of webrings + updated neighbor stamps. good day foodwise"},{"date":"9/21/25","notes":"worked on the index warning + about page YAY! college tmrw :("},{"date":"9/22/25","notes":"finished a substantial part of about section after spending a morosely tiring day at college."},{"date":"9/23/25","notes":"been feeling super sickly this week..discussed japanese perverseness + warcrimes with collegemates, was too tired to do anything of substance @ home (GOT DISSERTATION THEME + NEW PATREON SUBSCRIBER YAY)"},{"date":"9/24/25","notes":"came home @ 5.40 TT no lailu either, 90%ed hsr update in lab + DISCOVERED BJORK IN ALL OF HER GLORY"},{"date":"9/25/25","notes":"made report + applied to internships...lailu...college sucked"},{"date":"9/26/25","notes":"pretty sick (clogged nose + throat) but tolerated college anyway, continued bjork discovery! learnt how the LHC actually works (freaky stuff), bought ikea food ^__^ visited lailu 4 the last time in a while....was pretty productive application-report wise"},{"date":"9/27/25","notes":"train day....period started while i was hauling luggage around bruh. ALSO STEINS;GATE"},{"date":"9/28/25","notes":"extremely sick all day...eyes were quite literally glued shut and my cramps were @ their peak, regardless did some cc shopping + odd tasks + freaked out about prospective 100 usd "},{"date":"9/29/25","notes":"woke up battling the new odd af apoc (3 starred it though), lots of experimentation with blend modes and layering, 1st ts4 upload in a while! also did some mod cleanup"},{"date":"9/30/25","notes":"day started off on an extremely aggravating note (in relation to my sleeping schedule Facking again) but got better as it went by. lots of traditional junk food ingested (biryani + pooris)"},{},{"date":"10/1/25","notes":"did lots of site grunt work, photoshoot for asia, talked to friends on ig + twt after a long time! several picrews also + GOOD MUSIC DAY WAOWG"},{"date":"10/2/25","notes":"lots of site content + design curation, also made a new dl sim!"},{"date":"10/3/25","notes":"extremely personally disappointing day, could not start or do anything at all..spent the day liking taylor diss tweets (skull emoji) hatelistening to her album + going on 2016-17 nostalgia trips and hating everything about my life as evening rolled in"},{"date":"10/4/25","notes":"^ similar day and friendwise Bad (went on depressing nostalgia trips about people long gone Again) but gained consciousness somewhat in the evening"},{"date":"10/5/25","notes":"#travel-day DISCOVERED FROUFROU/IMOGEN HEAP LOML + slept really badly but issok :3 had a mean dal fry though"},{"date":"10/6/25","notes":"finished college early and held + played with lailu AFTER AN ENTIRE WEEK YAY!!!! slept for 2 hours @ home...my eyes r really itchy :( Also lakshmi puja + inchap Finally installed"},{"date":"10/7/25","notes":"mass emails sent out No expectations obv...started fruitless GRE study again + continued InChaP work! was told i could have 5 publications b4 graduating?"},{"date":"10/8/25","notes":"sickness resolution w eyedrops + lailu's vomiting resolution too ^^ BAGGED AN ISRO INTERNSHIP UNDER A BEAUTIFUL ASTROPHYSICIST LADY I COULD FUCKIN CRY (did today bc of ravikumar anw but whatever)"},{"date":"10/9/25","notes":"internship high finally wore off partially because of ammu news :( GAWD THIS GIRL I WILL KILL MYSELF BEFORE SHE DOES IT also scandinavian uni hunt...looking Into It"},{"date":"10/10/25","notes":"vibes were majorly off today but made it through the day. i think the continued exhaustion is Finally getting to me"},{"date":"10/11/25","notes":"all i did was icon curation + fucking around with lastfm profiles and music pages, also bought a new brush! Yay. had to stomach the horrible dissonance that comes with perusing old spam accounts and their bookmarks Like who is you"},{"date":"10/12/25","notes":"did lots of to-do tasks and sorted said tasks out! also did my first proper nuclear physics research task (amateur but im proud)"},{"date":"10/13/25","notes":"once again attempted several (pending) things but could end up doing nothing due to how energy-sapped i was from 5 hrs of college. bank bal is critcal but ordered parathas..."},{"date":"10/14/25","notes":"somehow sleeping by 11.30 is working super well? Finally got to sorting leftover tasks out, quiz + viva done!!!! discovered a Weird niche artist whose music (delectably) freaked me out. cleared several tabs + folders out"},{"date":"10/15/25","notes":"they threw my sanitizer away @ college … over a Fest ….. had to stay on campus until 5 freaking 30 (did succeed in making my first ever working bread board circuit woopee!) and was beyond exhausted and missed lailu time :( met a cool scholar on last.fm, Also scratched my inner gums and left thigh?"},{"date":"10/16/25","notes":"went to college #late, got admonished by teach over my general Tardiness :P laptop is fucked once again"},{"date":"10/17/25","notes":"lowkey nothingburger college day but i finally finished Perfume, banger book, baybee time! rounded up inspo for dream mascot"},{"date":"10/18/25","notes":"MADE THEE CUTEST OC/SIM/MASCOT FOR USE EVERYWHERE SHES SO PRETTY + PERFECT im so proud of myself ;__; cc shopping after a rlly long time, mod updates... also #studied + discovered new ambient music"},{"date":"10/19/25","notes":"#studied but not until finishing up some research on Nordic QOL + future pathways, texting spoorthy again (positive!) and (renewed) attempting site work"},{"date":"10/20/25","notes":"started the herculean task of clearing all socmed accounts out, fucked around with dulce's wardrobe, coulnt rlly do anything today because of severe brainfog (did work on Notion lowk)"},{"date":"10/21/25","notes":"lailu ate fully by my hand for da first time ;; rlly did nothing much today outside of yt surfing + effing around w dulce's wardrobe, o yeah also found alot of my hindu school peers on linkedin !!!"},{"date":"10/22/25","notes":"did some serious studying today but only for the day's last 3 hours, rediscovered prsk music ^__^ bad apple ft. sekai so goated, also cleared most of creammoire out"},{"date":"10/23/25","notes":"mutualed several lesbians on twt on a random whim...reinstalled zzz again for the pretty graphics (+ occupance for when truly bored), misc profile updates + discovered the Changelings + did mri place searches w cousin + no studying per usual"},{"date":"10/24/25","notes":"another juiceless day of procrastination goes by. im no more prepared for the exam on Sunday as i was a month ago! also carrd revamps after a rlly long time + random tasks :3"},{"date":"10/25/25","notes":"it really is the small things in life because the best parts of today and this entire month to me were spending time with lailu, discovering a treasure trove of art books on ehentai + enjoying a hearty meal of kebabs, parathas, tuna with shittu and family..."},{"date":"10/26/25","notes":"GRE was average and i lowk couldve done better if i just Studied A Little..wtvr, went to Lulu + ate far too much and was pumpkinpilled in bed 60% of the day. shittu's last day..."},{"date":"10/27/25","notes":"first day of clg after the weeklong vacay :( was Nawt happy to be back in class but the content was interesting. zzzmaxxed"},{"date":"10/28/25","notes":"lab was nothingburger, Finally farmed all the way to getting lucia and now i feel nothing"},{"date":"10/29/25","notes":"im so excited for LUX !!!!! finished lots of pending homework today + got to know of New/Better opportunities 4 future.."},{"date":"10/30/25","notes":"boring day, came up with + discarded new layout idea in the span of today + yesterday (dled so many beaut 3D graphics and for What ;;), lots of zzz (sidequesting) gameplay"},{"date":"10/31/25","notes":"period started nothingburger college day but i was served complimetary puris with channa + banger gulab jamuns (and unfiltered zzz time during senior vivas :3) only 1 class though..."},{},{"date":"11/1/25","notes":"FINALLY organized all of my pending tasks piled up from ages ago! played a lot of zzz outside of that and nothing much else; first listens for utopia + everybody scream (i Now have a  material thing i rlly want in life)"},{"date":"11/2/25","notes":"had the nastiest headache (in 2 shifts) almost all of today. no tangible work done but Hey at least i got to enjoy the wcwc :) + Finally get elysia on hi3"},{"date":"11/3/25","notes":"super sleepy per usual couldnt get any work done, classes were mildly interesting + geeked out with ammu over handwritings! also forgot to mention today's food was Crazy good..with the enigmatic white fish preparation + broccoli/paneer..."},{"date":"11/4/25","notes":"too much happened @ the same time today vv overwhelmed..(dogshit) GRE results + random comments on substack/patreon etc RAN MY 1ST SIMULATION EVER! (also tried changing my ringtone and it almost blew my pc + phone up)"},{"date":"11/5/25","notes":"more than mildly disappointing day, bus rides were horrible + hsr is shit + cyrene is a bitch Also i need to move out so badly and away from these people's bickering"},{"date":"11/6/25","notes":"omg bruh i keep playing currency wars/grinding zzz i gotta stop my work is piling up T__T chill day @ clg in lieu of term exams"},{"date":"11/7/25","notes":"last working day before exams, rlly did nothing much outside of zzz + hsr-ing on reaching home. first listen of LUX !!!"},{"date":"11/8/25","notes":"weeks long artbook installing saga finally came to an end...kept edging quamech study all day :( (currency wars + file org)"},{"date":"11/9/25","notes":"hsr has taken me to places i wouldnt go with a gun (ebegging online + asking a stranger for crystals)... currency wars + played AA @ midnight (dogshit score) but hey got hyacine lc"},{"date":"11/10/25","notes":"caved and bought bp early with a dent in bank acc, absolutely bricked to the top with snot on the inside and head feels super heavy :) didnt study of course"},{"date":"11/11/25","notes":"the universe has a really neat way of sorting things out huh (bank bal issue resolved + aced qmech (:) did drop my laptop nastily though i hope it holds out"},{"date":"11/12/25","notes":"exam was somewhat mid but better than anything from the last 4 yrs. my adhd's gotten sm worse i could Laugh + Very excruciating yearning for a place amidst creatives in mainstream media, starting watching pluribus!!! (peak) + finalized vtuber rigplan"},{"date":"11/13/25","notes":"last exam!!! it was so good my hands hurt (bc of how much extra i wrote Lol) got rlly interested in color theory? + lots of future finance calculations...finished steins;gate :) (hetslop i endorse)"},{"date":"11/14/25","notes":"first day of short lived freedom, lowkey wasted it (dosa invitation @ lailu's!) + did a 10p bond for fua on currency wars lol"},{"date":"11/15/25","notes":"finished lots of pending/useless list stuff (like continuing artbook org + making the xiuxiu everything playlist on AM), listened to Lots of music (incl new FKA) + switched to profesh CV format! most importantly, #finished currency wars"},{"date":"11/16/25","notes":"lackluster day but...finished all artbook org + worked out my full creative ecosystem #rid myself of adobe ^^ mom came back erm"},{"date":"11/17/25","notes":"powered up ts4 after years, cleaned my laptops up to an extent, sorted a bit of my to-do list out... installed the creative suite softwares i decided on, tiny bit of side refreshing asw"},{"date":"11/18/25","notes":"read some yaoi after a Really long time, finished status.cafe layout finally (sawrry fruiche for copying </3), tried finishing at least 10% of my pending work and failed miserably!!!"},{"date":"11/19/25","notes":"tired as hell but finished most of my pending homework + assignments throughout the day"},{"date":"11/20/25","notes":"did serious work from evening to night straight after an exhausting day @ college im truly a ResearcherTM now"},{"date":"11/21/25","notes":"watched and started several shows today im surprised? had a talk so most classes were bust, went 2 ikea :)"},{"date":"11/22/25","notes":"spent the day cleaning out TS4 files + backing things up given The News, perfected soren :D...also worked on some pending tasks, had delish kebabs with a brinjal side"},{"date":"11/23/25","notes":"couldnt achieve anything too productive but ive cleaned out almost all of both my laptops out ^__^"},{"date":"11/24/25","notes":"finished adolescence :( and all but one chapter of NLMG :( otherwise nothingburger day, also finally got cyrene + now i have almost 4 archetype premium teams (cleared all endgame Lol)"},{"date":"11/25/25","notes":"looked into french unis for applying, college journey was (mostly) useless but had panipuri after a long while...renewed vigor for fundamental clearance + finished all cloud uploads for now!!!"},{"date":"11/26/25","notes":"studied for maybe 45 minutes but hey its a #Start, mainly time + energy sucked away by drive2drive transfer of images"},{"date":"11/27/25","notes":"studied for 3 whole hours today #WeLovePW (and in-depth!)"},{"date":"11/28/25","notes":"redownloaded ZZZ (to my dismay lowk) + took the initial step towards blender crafting only to get Fucking Ignored by simsppl! mera kya lmfao + ajji left :( restarted nuc work..."},{"date":"11/29/25","notes":"really couldnt do much outside of working on my CV + applis"},{"date":"11/30/25","notes":" + college assignments galore, nuc work is so laborious omg, finished my CV mostly + also my SOP (general structure etc)"},{},{"date":"12/1/25","notes":"monday :( talked to muttu sir about remaining nuc work questions + got things clarified, zzz grinded @ home"},{"date":"12/2/25","notes":"had a food party (of like 4 sandwiches (tiny) + a cheese pizza) for the first time with current batchmates since degree started.. Also got dialyn after 3-4 days of gruelling grinding."},{"date":"12/3/25","notes":"many minor annoyances some of which sorted themselves out but things are starting to feel uneasy again. started rereading uriah + finished french applis + wrapped !!!! and los thuthanaka"},{"date":"12/4/25","notes":"finished nuclear paper 1 finally (and reread uriah too)....ngl im so over this jama bitch ive never had anybody be this vile to me in so long but at the end of the day shes from fuckass simstwt anyway. worried about money + hsr acc :/ and also friday's seminar"},{"date":"12/5/25","notes":"no money still im lowk giving up on it. fully finished my sen-copied status cafe layout !! skipped evening class to come and work on seminar...but only rlly worked from 9 pm to 11 lol"},{"date":"12/6/25","notes":"seminar day which actually went Surprisingly Well! biophysics work astounded both student + teacher body hehe. so exhausted though that i conked out at 6.30 all the way to 8 next day..started playing DE again today ^__^"},{"date":"12/7/25","notes":"kinda just cycled through 2 disco elysium playthroughs in all of today (mindblowing shit btw today was when i truly experienced DE Properly for the first time but lets leave it for my shrine) + shifted back setup to main room :/ lots of good food! x3 times"},{"date":"12/8/25","notes":"came home early but could not utilize it in any way that matters </3 removed negative hsr balance Finally...payoneer reg + whatnot, finished earthlings..!?"},{"date":"12/9/25","notes":"STARTED WORKING ON SITE AGAIN YAY my laptop is pissing me the actual fuck off. nothingburger week so far bc of BTech exams, i need to start watching lectures during class hours..."},{"date":"12/10/25","notes":"coded bunch...will work on about/media later this week, on my final 30 bucks rn ;__; work piling up but 4 the final time Phew"},{"date":"12/11/25","notes":"spent 80% of the day with lailu (morning afternoon part of the evening) since classes were Mostly cancelled, idyllic day"},{"date":"12/12/25","notes":"found out i lost my metro card + found it?? got 10 dollars for a random sim...otherwise tired rest of the day (also good amount of ts4 clean up + updates + shopping)"},{"date":"12/13/25","notes":"health checkup day. lots of travelling (not the good type), thankfully only had to give blood once + rlly scrumptious breakfast spread; stuffed myself to the point i was full till 6 TT"},{"date":"12/14/25","notes":"nothingburger day but i was at ease doing Nothing after a looong time.. watched shinchan horror eps !!! Found them @ long last"},{"date":"12/15/25","notes":"tried seriously working seriously on site by collecting materials but it just wont work out...started walking for 30 min today! listened to rochelle jordan debut (half of)"},{"date":"12/16/25","notes":"girl i ate so much today my belly was inflated throughout TT an entire mini paneer pizza + a slice of mushroom pizza and an icecream sandwich and also my lunch...not to mention a spaghetti dinner (while watching Horror Shinchan)..wrote out the emails i was procrastinating on! brainstormed 4 site"},{"date":"12/17/25","notes":"dosa date @ lailu's....college was a bummer but finished NE lab. very uneventful day in general but i did watch No Smoking which changed my cinephile status to Serious!"},{"date":"12/18/25","notes":"lailu goes away tmrw so spent a bunch of time with her... lots of zzz upgrades + farming, muttu sir's phd presentation? discovered james K fully (shes my current idol)"},{"date":"12/19/25","notes":"gave a tiny seminar (unprepared but got away with it), super tired so couldnt do much but lots of site brainstorming!"},{"date":"12/20/25","notes":"hospital day (again...), ate a rlly filling dosa + the doc loved me a lot for some reason TT owing to astro HAHA, also reinstalled R1999 to feel something (gacha gamed quite a bit)"},{"date":"12/21/25","notes":"kinda lacklustre day except went to ikea with mom, ate sm within 650 rupees!!! everything was super festive, saw a band (not perform though) + biblical storytelling :) started proper coding"},{"date":"12/22/25","notes":"coded A Lot sitewise today....nothing else rlly (procrastinated on college work a bit too much which is making me anxious)"},{"date":"12/23/25","notes":"did manual filling work both @ college + home primarily and gamed when free. discovered thom yorke's suspiria music PEAK"},{"date":"12/24/25","notes":"tiring college day, experiment went super well! watched cure It was so incredible..no film has sated me this much in a good while"},{"date":"12/25/25","notes":"did not do anything at all because og wayanad plans were wrecked but watched dhurandhar @ 10 and thoroughly enjoyed!"},{"date":"12/26/25","notes":"was supposed to be at kerala... nvm. college was boring But finally got around to my Your Name rewatch and it still banged"},{"date":"12/27/25","notes":"nothingburger day (probably because of the weeklong mental + physical exhaustion)"},{"date":"12/28/25","notes":"came down with an \"internal\" fever again with chills and everything...even so worked on all assignments to completion"},{"date":"12/29/25","notes":"was supposed to go to college but put it off bc of how sick i was, finished all pending work, slept? lailu meeting again!"},{"date":"12/30/25","notes":"THEY FUCKING POSTPONED THE DAMN MOCK... came back home With parents. spent 80% of the day with lailu but health got worse TT also lost the ysg 50/50 at this point who gaf"},{"date":"12/31/25","notes":"spent the day being sick and failing to decide on a movie to end the year with. Yay. also second last mock"}]